/* TASK 1
Сделайте таблицу 5x5
При клике на элемент, изменяйте цвет у элемента на красный.
Но цвет у элемента должен изменяться пропорционально в другой половине квадрата
Пример 3х3:
[]|[]|[]
[]|[]|[]
[]|[]|[]
кликаем сюда -> []|[]|[]
                []|[]|[]
                []|[]|[x] <- загорается тут
                []|[]|[]
кликаем сюда -> []|[]|[x] <- загорается тут
                []|[]|[x]
*/
var cells = document.querySelectorAll('td');
var arr = [...cells].reverse();
[...cells].forEach((cell, i) => {
    cell.addEventListener('click', (event) => {
        arr[i].style.backgroundColor = 'red';
    });
});